---
kind: method
id: M:Autodesk.Revit.DB.CombinableElementArray.Append(Autodesk.Revit.DB.CombinableElement)
source: html/8b82eaa7-102a-2839-d602-ccd81df40a40.htm
---
# Autodesk.Revit.DB.CombinableElementArray.Append Method

Add the element to the end of the array.

## Syntax (C#)
```csharp
public virtual void Append(
	CombinableElement item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.CombinableElement`) - The CombinableElement to be added.